[OmegaWarCry X2AbilityTemplate]
LocFriendlyName="战争咆哮"
LocLongDescription="欧米伽狂战士的战争咆哮将会使它周围所有的狂战士和变种人变得更加强壮。+10命中，+20防御，+2移动。持续2回合。"
LocHelpText="欧米伽狂战士的战争咆哮将会使它周围所有的狂战士和变种人变得更加强壮。+10命中，+20防御，+2移动。持续2回合。"
LocFlyOverText="战争咆哮"

[OmegaRush X2AbilityTemplate]
LocFriendlyName="好斗"
LocLongDescription="欧米伽狂战士在遭到伤害时会触发其额外的侵略行为。"
LocHelpText="欧米伽狂战士在遭到伤害时会触发其额外的侵略行为。"
LocFlyOverText="好斗"

[OmegaRushPassive X2AbilityTemplate]
LocFriendlyName="好斗"
LocLongDescription="欧米伽狂战士在遭到伤害时会触发其额外的侵略性行为。"
LocHelpText="欧米伽狂战士在遭到伤害时会触发其额外的侵略性行为。"
LocFlyOverText="好斗"

[PlasmaQuake X2AbilityTemplate]
LocFriendlyName="等离子震击"
LocLongDescription="等离子震击是一种毁灭性的技能。欧米伽狂战士通过欧米伽巨锤锤击地面来炙烤周遭区域并使其起火。任何被卷入技能中的生物都会受到爆炸和火焰伤害。"
LocHelpText="等离子震击是一种毁灭性的技能。欧米伽狂战士通过欧米伽巨锤锤击地面来炙烤周遭区域并使其起火。任何被卷入技能中的生物都会受到爆炸和火焰伤害。"
LocFlyOverText="等离子震击"

[OmegaDevastatingPunch X2AbilityTemplate]
LocFriendlyName="毁灭锤击"
LocLongDescription="欧米伽狂战士的力量成倍地增加了巨锤武器的致命性。 这种攻击既可以破甲，也可以使目标陷入昏迷或混乱。"
LocHelpText="锤击近战范围目标，该攻击破甲并有可能击晕目标"
LocFlyOverText="毁灭锤击"

[OmegaMeleeResistance X2AbilityTemplate]
LocFriendlyName="近战抗性"
LocLongDescription="欧米伽狂战士面对所有近战攻击时受到的伤害减少4点。"
LocHelpText="减少近战伤害"
LocFlyOverText="近战抗性"

[BerserkerOmega X2CharacterTemplate]
strCharacterName="欧米伽狂战士"
strAcquiredText="欧米伽狂战士是被创造出来破坏一切的狂暴野兽。它们在数息之间便可夷平一大片区域。" 